# AsAggregate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..AsAggregate Method
IFCData Class See Also
---
Gets storage value as IFCAggregate when its PrimitiveType is aggregate.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IFCAggregate AsAggregate()
```

Visual Basic
---
```text
Public Function AsAggregate As IFCAggregate
```

Visual C++
---
```text
public:
IFCAggregate^ AsAggregate()
```

# ### Return Value
The IFCAggregate.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | The primitive type is not aggregate. |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace